Catalogs/ЛБ_ГруппыЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ГруппыЛомбардов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_УстановитьЛомбардыВГруппу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьЛомбардыВГруппу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ГруппыЛомбардов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЛБ_ГруппыЛомбардов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Объект.Ссылка = Справочники.ЛБ_ГруппыЛомбардов.ЛомбардыВнеГрупп Тогда 
		Элементы.Ломбарды.Видимость = Ложь;
	Иначе 
		УстановитьОтборЛомбарды(); 
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Процедура УстановитьОтборЛомбарды() 
	ЭлементОтбора = Ломбарды.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Группа");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
КонецПроцедуры	

&НаСервере
Процедура ПослеУстановкиВГруппу(Результат, ДопПараметры) Экспорт 
	Ломбарды.Отбор.Элементы.Очистить();
	УстановитьОтборЛомбарды();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВГруппу(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Необходимо сначала записать элемент справочника", Статуссообщения.Информация);
		Возврат;
	КонецЕсли;	

	Параметрыформы = Новый структура;
	ПараметрыФормы.Вставить("Группа", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеУстановкиВГруппу", ЭтаФорма);
	ОткрытьФорму("Документ.ЛБ_УстановитьЛомбардыВГруппу.ФормаОбъекта", Параметрыформы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
